{
    "personal": {
        "name": "PRASANNA HEGDE",
        "addressLine1": "Honavar, Karnataka - 581 334",
        "email": "prashgde@gmail.com",
        "phone": 9591618890
    },
    "social": {
        "linkedIn": "https://www.linkedin.com/in/prasanna-hegde/",
        "facebook": "https://www.facebook.com/prasanna.hegde.7712",
        "instagram": "https://www.instagram.com/impetuously_versatile",
        "twitter": "https://twitter.com/prashgde"
    },
    "profSummary": "Highly skillful, successful Software Engineer with verifiable success in delivering appropriate technology solutions to the customers. Comprehensive knowledge of agile methodologies, desktop and web-based applications. Innovative change agent with a unique mix of high-level technology direction and deep technical expertise. Keenly interested in persuing the career as a full stack developer.",
    "empHistory": {
        "jobs": [
            {
                "title": "Software Design Engineer II, Tektronix Engineering India Private Limited, Bangalore",
                "responsibilities": [
                    "Design and develop platform independent software solutions and web solutions that enable users to communicate to instruments and control them using PC.",
                    "Use systematic approches and tools to design, develop and test the software and improve the quality."
                ],
                "period": {
                    "startDate": "July 1, 2014",
                    "endDate": null
                }
            },
            {
                "title": "Intern, Gnostice Information Technologies, Bangalore",
                "responsibilities": [
                    "Implement software using architectural and detailed design given.",
                    "Build a developer friendly backend class library that provides generic API's.",
                    "Consume the API's and build the UI using existing libraries."
                ],
                "period": {
                    "startDate": "Jan 1, 2014",
                    "endDate": "Jun 1, 2014"
                }
            }
        ]
    },
    "education": {
        "institutes": [
            {
                "name": "Rastriya Vidyalaya College of Engineering, Bangalore",
                "yearOfPassing": 2014,
                "result": "CPGA: 8.82"
            },
            {
                "name": "Alva's Pre-University College, Moodabidri",
                "yearOfPassing": "2010",
                "result": "Percentage: 94.83"
            }
        ]
    },
    "projects": [
        {
            "title": "Resume Builder",
            "descriptionItems": [
                "A simple and elagant way to build your resume from scratch.",
                "Built with React to ensure faster rendering.",
                "Uses Material UI keeping the user interface tidy.",
                "Uses Express on the backend and MongoDB.",
                "This resume is built using this tool."
            ],
            "responsibilities": [
                "Developed the front end using React.",
                "Learnt MongoDB, created models and implemented REST API's using Express.",
                "Integrated the components."
            ]
        },
        {
            "title": "TekExcelAddin Prototype",
            "descriptionItems": [
                "TekExcelAddin is an add-in to Microsoft™ Excel and allows the users to connect to an oscilloscope, send and receive settings, capture and plot waveform data, measurements and Triggered captures.",
                "Has a responsive UI built using UI Fabric React.",
                "Uses Node server to provide REST API's.",
                "Node server communicates to C/C++ instrument parser using sockets.",
                "This was not productized due to security reasons."
            ],
            "responsibilities": [
                "Designed the user interface for the add in using Fabric React.",
                "Implemented an N-API wrapper to invoke native API's on the instrument side from Node.",
                "Developed a working prototype that can communicate to any instrument."
            ]
        },
        {
            "title": "TekExcelAddin",
            "descriptionItems": [
                "An add-in to Microsoft™ Excel and allows the users to connect to an oscilloscope, send and receive settings, capture and plot waveform data, measurements and Triggered captures.",
                "Enables post analysis of data. What a user can achieve with it is only restricted by his/her imagination.",
                "It's a C# Winform Application that uses TCP sockets to communicate to the instrument parser"
            ],
            "responsibilities": [
                "Refined the requirements.",
                "Implemented the complete UI and backend."
            ]
        },
        {
            "title": "LXI",
            "descriptionItems": [
                "LXI stands for LAN eXtensions for Instrumentation. It is the standard for LAN equipped instrumentation that helps reduce the time it takes to set up, configure, and debug test systems.",
                "Provides a web solution to access, control supported instruments.",
                "Enables Remote Desktop feature on a browser as an option.",
                "Ensures broad instrument availability",
                "Is supported by a wide array of instruments.",
                "Uses tomcat web server as a middleware between the Web UI and the instrument parser."
            ],
            "responsibilities": [
                "Develped the web UI and added tomcat server support.",
                "Implemented tomcat server support at the backend.",
                "Implemented Java Servelets.",
                "Added support to new instrument series.",
                "Actively involved in regular maintenance and bux fixes."
            ]
        },
        {
            "title": "LXI Talker/Listener",
            "descriptionItems": [
                "Talker/Listener is a tool added to LXI as a company specific feature.",
                "Enables user to send commands, change instrument settings and also get back response from instruments using web interface.",
                "It's integrated to LXI and works like any other LXI web page."
            ],
            "responsibilities": [
                "Refined the requirements.",
                "Implemented the UI.",
                "Implemented Servlets.",
                "Implemented the C/C++ backend."
            ]
        }
    ],
    "rewsAndReco": [
        "Runner up of Best Booth for TekExcel Addin in Scintilla 2018, an Engineering symposium held at Tektronix, Fluke, Anderson-Negele and Setra.",
        "Mutliple 'Inspire Awards' for contribution to LXI Certification for different series of instruments.",
        "Runner Up at Table Tennis Tournament held at Tektronix, Fluke, Anderson-Negele.",
        "Winner of Fortive has got talent for singing/whistling performace.",
        "Winner of several cultural activities held at Tektronix and Fluke.",
        "Was selected for District Level Hindusthani Classical Music in Uttara Kannada for singing with Harmonium."
    ],
    "workshops": [
        "Workshop on Office App Development by Microsoft Corporation held at Chancery Pavilion, Bangalore at 2015.",
        "Information Security & Cyber Forensics coundcted by CyberCure Solutions at Dept. of CSE< RVCE in Feb, 2012.",
        "Android Application Development conducted by Blrdroid in Dept. of CSE, RVCE in Feb 2013."
    ],
    "interests": [
        {
            "category": "Music",
            "interests": [
                "Sing",
                "Play harmonium and piano"
            ]
        },
        {
            "category": "Sports",
            "interests": [
                "Table Tennis",
                "Badminton"
            ]
        },
        {
            "category": "Misc",
            "interests": [
                "Chess",
                "Rubik's cube"
            ]
        }
    ]
}